{
  "batch_id": "batch_001",
  "version": "1.0.0",
  "image_count": 1,
  "uploaded_at": {
    "_seconds": 1765707231,
    "_nanoseconds": 523000000
  },
  "description": "GPE tactical scenario images - Base batch",
  "images": [
    {
      "id": "gpe_generated_001",
      "imageUrl": "https://storage.googleapis.com/ssbmax-49e68.firebasestorage.app/gpe_images/gpe_gen_map.png",
      "scenario": "You are a group of 8 students from Government College, returning from a nature camp in the forest. You are currently at the 'Rest House' (marked on likely map). It is 1400 hrs. The last bus to the city leaves from the 'Bus Stop' at 1700 hrs, which is 15 km away.\n\nWhile resting, a local villager rushes to you and informs:\n1. A massive fire has broken out in the forest (North side) and is spreading towards the 'Tribal Settlement'. The villagers need immediate evacuation.\n2. He saw a group of suspicious men planting explosives under the 'Railway Bridge' (as shown in map). A passenger train is due to pass in 45 minutes.\n3. One of his friends has been bitten by a poisonous snake and is unconscious at the 'Old Temple' (East side).\n4. Your own college van has a flat tire and the driver is missing.\n\nResources available:\n- 1 Jeep (can carry 4 people, speed 40 kmph on road, 20 kmph on track)\n- 1 Motorboat at the river bank (capacity 3, speed 15 kmph)\n- A bundle of rope, a first aid kit, and 2 flashlights.\n- No mobile network coverage.\n\nTask:\nIdentify the problems, prioritize them, and produce a plan to handle all situations effectively and reach the Bus Stop by 1700 hrs to catch your bus.",
      "imageDescription": "Tactical map showing a river with a railway bridge, a forest area to the north, a tribal settlement, a temple to the east, and connecting roads.",
      "resources": [
        "Jeep",
        "Motorboat",
        "Rope",
        "First Aid Kit",
        "Flashlights"
      ],
      "viewingTimeSeconds": 60,
      "planningTimeSeconds": 1740,
      "minCharacters": 500,
      "maxCharacters": 2000,
      "category": "Tactical",
      "difficulty": "HARD"
    }
  ]
}